fixed architecture diagram
